<div style="direction:ltl;line-height:100%;"><font face="B Nazanin" size=4>
<font color=#007E06 size=3>
    <h1>Group by</h1>
</font>

<font size=4 >
    
 بر حسب یک از ستون ها می توانیم گروه تشکیل دهیم

         
split = تقسیم مجموعه داده به یکسری گروه

  
applying function = انجام کار های اماری 
 
 </font>
 </div>

In [41]:
import numpy as np
import pandas as pd

In [42]:
data ={
    'team' :['a','b','c','d','e','f','g','h'],
    'rank' :[ 1,  2,  2,  3,  np.nan,  4,  2,  3],
    'year' :[2014,2015,2014,2020,2019,2018,2012,2027],
    'points':[897,789,650,770,900,820,np.nan,699]
}
df = pd.DataFrame(data)
df

  team  rank  year  points
0    a   1.0  2014   897.0
1    b   2.0  2015   789.0
2    c   2.0  2014   650.0
3    d   3.0  2020   770.0
4    e   NaN  2019   900.0
5    f   4.0  2018   820.0
6    g   2.0  2012     NaN
7    h   3.0  2027   699.0

In [43]:
df.groupby("team").groups

{'a': [0], 'b': [1], 'c': [2], 'd': [3], 'e': [4], 'f': [5], 'g': [6], 'h': [7]}

In [44]:
df.groupby(["year","team"]).groups

{(2012, 'g'): [6], (2014, 'a'): [0], (2014, 'c'): [2], (2015, 'b'): [1], (2018, 'f'): [5], (2019, 'e'): [4], (2020, 'd'): [3], (2027, 'h'): [7]}

In [45]:
grouped = df.groupby('year')
grouped.groups

{2012: [6], 2014: [0, 2], 2015: [1], 2018: [5], 2019: [4], 2020: [3], 2027: [7]}

In [46]:
def grouped_function():
    for name , group in grouped:
        print((name),(group))
grouped_function()

2012   team  rank  year  points
6    g   2.0  2012     NaN
2014   team  rank  year  points
0    a   1.0  2014   897.0
2    c   2.0  2014   650.0
2015   team  rank  year  points
1    b   2.0  2015   789.0
2018   team  rank  year  points
5    f   4.0  2018   820.0
2019   team  rank  year  points
4    e   NaN  2019   900.0
2020   team  rank  year  points
3    d   3.0  2020   770.0
2027   team  rank  year  points
7    h   3.0  2027   699.0

In [47]:
grouped.get_group(2014)

  team  rank  year  points
0    a   1.0  2014   897.0
2    c   2.0  2014   650.0

In [48]:
grouped.get_group(2014)['team'][2]

'c'

In [49]:
grouped['points'].agg('mean')

year
2012      NaN
2014    773.5
2015    789.0
2018    820.0
2019    900.0
2020    770.0
2027    699.0
Name: points, dtype: float64

In [50]:
grouped['points'].agg('size')

year
2012    1
2014    2
2015    1
2018    1
2019    1
2020    1
2027    1
Name: points, dtype: int64

<div style="direction:ltl;line-height:200%;">
    <font color=#A42E2F size=4>
        size : have missing & count : without missing"
    </font>
</div>

<div size=3>if (don't have missing): n(size) = n(count)</div>

In [51]:
grouped['points'].count()

year
2012    0
2014    2
2015    1
2018    1
2019    1
2020    1
2027    1
Name: points, dtype: int64

In [52]:
grouped['points'].agg(['sum','mean','std'])

         sum   mean         std
year
2012     0.0    NaN         NaN
2014  1547.0  773.5  174.655375
2015   789.0  789.0         NaN
2018   820.0  820.0         NaN
2019   900.0  900.0         NaN
2020   770.0  770.0         NaN
2027   699.0  699.0         NaN

In [53]:
score = lambda x : x*2# مقادیر در گروپد را دو برابر کن
grouped.transform(score)

  team  rank  points
0   aa   2.0  1794.0
1   bb   4.0  1578.0
2   cc   4.0  1300.0
3   dd   6.0  1540.0
4   ee   NaN  1800.0
5   ff   8.0  1640.0
6   gg   4.0     NaN
7   hh   6.0  1398.0

In [54]:
grouped['points'].transform(score)

0    1794.0
1    1578.0
2    1300.0
3    1540.0
4    1800.0
5    1640.0
6       NaN
7    1398.0
Name: points, dtype: float64

In [55]:
grouped.filter(lambda x : len(x)>= 2)

  team  rank  year  points
0    a   1.0  2014   897.0
2    c   2.0  2014   650.0